#Даны две строки. Посчитайте сколько раз каждый символ первой строки встречается во второй
s1 = "one"
s2 = "onetwonine"
k = s1.count(s2)
print("k = ", k)